{"title":"Space 2.0 by Rod Pyle EPUB","magnet":"magnet:?xt=urn:btih:0ed50e306141f46db6edea890e7b2a50cbb1f8de&dn=Space+2.0+by+Rod+Pyle+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"41169738","seeders":"0","leechers":"0","description":"xx\r\n\r\nSpace 2.0 by Rod Pyle EPUB\r\n\r\nNo longer the exclusive domain of government entities such as NASA and other national agencies, space exploration is rapidly becoming privatized, with entrepreneurial startups building huge rocket boosters, satellites, rocket engines, asteroid probes, prospecting craft, and even commercial lunar cargo landers to open this new frontier. Research into ever more sophisticated propulsion and life support systems will soon enable the journey to Mars and destinations deeper in our solar system. As these technologies continue to move forward, there are virtually no limits to human spaceflight and robotic exploration.  \r\n\r\nWhile the world has waited since the Apollo lunar program for the next &quot;giant leap,&quot; these critical innovations, most of which are within our grasp with today&apos;s technology, will change the way we live, both in space and on Earth. A new space age-and with it, a new age of peace and prosperity on Earth, and settlement beyond our planet-can be ours.  \r\n\r\nSpeaking with key leaders of the latest space programs and innovations, Rod Pyle shares the excitement and promise of this new era of exploration and economic development. From NASA and the Russian space agency Roscosmos, to emerging leaders in the private sector, Space 2.0 examines the new partnerships that are revolutionizing spaceflight and changing the way we reach for the stars.\r\n\r\nxx","last_updated":"2019-03-05T10:12:48.271Z","parsed":{"xt":"urn:btih:0ed50e306141f46db6edea890e7b2a50cbb1f8de","dn":"Space 2.0 by Rod Pyle EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"0ed50e306141f46db6edea890e7b2a50cbb1f8de","infoHashBuffer":{"type":"Buffer","data":[14,213,14,48,97,65,244,109,182,237,234,137,14,123,42,80,203,177,248,222]},"name":"Space 2.0 by Rod Pyle EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}