{"title":"The Art of Leaving by Ayelet Tsabari EPUB","magnet":"magnet:?xt=urn:btih:6b81295bf6c8edb018072f937cacebbaf5ca3810&dn=The+Art+of+Leaving+by+Ayelet+Tsabari+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1839621","seeders":"0","leechers":"0","description":"xx\r\n\r\nThe Art of Leaving by Ayelet Tsabari EPUB\r\n\r\nAn intimate memoir in essays by an award-winning Israeli writer who travels the world, from New York to India, searching for love, belonging, and an escape from grief following the death of her father when she was a young girl.\r\n\r\nThis searching collection opens with the death of Ayelet Tsabari&#x2019;s father when she was just nine years old. His passing left her feeling rootless, devastated, and driven to question her complex identity as an Israeli of Yemeni descent in a country that suppressed and devalued her ancestors&#x2019; traditions.\r\n\r\nIn The Art of Leaving, Tsabari tells her story, from her early love of writing and words, to her rebellion during her mandatory service in the Israeli army. She travels from Israel to New York, Canada, Thailand, and India, falling in and out of love with countries, men and women, drugs and alcohol, running away from responsibilities, and refusing to settle in one place. She recounts her first marriage, her struggle to define herself as a writer in a new language, her decision to become a mother, and finally, her rediscovery and embrace of her family history - a history marked by generations of headstrong women who struggled to choose between their hearts and their homes. Eventually, she realizes she must reconcile the memories of her father and the sadness of her past if she is ever going to come to terms with herself.\r\n\r\nWith fierce, emotional prose, Ayelet Tsabari crafts a beautiful meditation about the lengths we will travel to try to escape our grief, the universal search to find a place where we belong, and the sense of home we eventually find within ourselves.\r\n\r\nxx","last_updated":"2019-03-05T10:12:47.328Z","parsed":{"xt":"urn:btih:6b81295bf6c8edb018072f937cacebbaf5ca3810","dn":"The Art of Leaving by Ayelet Tsabari EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"6b81295bf6c8edb018072f937cacebbaf5ca3810","infoHashBuffer":{"type":"Buffer","data":[107,129,41,91,246,200,237,176,24,7,47,147,124,172,235,186,245,202,56,16]},"name":"The Art of Leaving by Ayelet Tsabari EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}