{"title":"The Art of Dying Well by Katy Butler EPUB","magnet":"magnet:?xt=urn:btih:b51bfc68708377a63aa502269eb66d0358b5366a&dn=The+Art+of+Dying+Well+by+Katy+Butler+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"4071517","seeders":"1","leechers":"1","description":"xx\r\n\r\nThe Art of Dying Well by Katy Butler EPUB\r\n\r\nAn inspiring, informative, and practical guide to navigating end-of-life issues, by a groundbreaking expert in the field and the New York Times best-selling author of Knocking on Heaven&#x2019;s Door. \r\n\r\nIn the mid-1400s, an unnamed Catholic monk composed a popular self-help book called Ars Moriendi, or The Art of Dying. Written in Latin, this medieval death manual taught people how to navigate the trials of the deathbed using simple rituals of repentance, reassurance, and letting go. \r\n\r\nBest-selling author and award-winning journalist Katy Butler argues that we have lost touch with the &#x201C;art of dying&#x201D; as practiced by our ancestors, yet we still hunger for rites of passage and a sense of the sacred, especially in the important life transitions of aging and dying. Butler has lectured at medical schools and spoken with community and caregiving organizations across the country. Here she reveals what she has learned about dying in America today - and how to have a better end of life. \r\n\r\nWe are coping with a medical system in disarray in its approach to people who are aging, dying, or chronically ill. Butler argues it&apos;s not about living as long as possible, it&apos;s about living as well as possible. Not only does our current system poorly serve our medical needs, it also crowds out any sense of the sacred. It&#x2019;s time to restore a sense of &#x200B;honor&#x200B;, and through exploring the stages of later life, sharing &#x201C;good death&#x201D; stories, as well as offering practical takeaways, The Art of Dying Well illuminates a path to a better end of life. \r\n\r\nxx","last_updated":"2019-03-05T10:36:45.312Z","parsed":{"xt":"urn:btih:b51bfc68708377a63aa502269eb66d0358b5366a","dn":"The Art of Dying Well by Katy Butler EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"b51bfc68708377a63aa502269eb66d0358b5366a","infoHashBuffer":{"type":"Buffer","data":[181,27,252,104,112,131,119,166,58,165,2,38,158,182,109,3,88,181,54,106]},"name":"The Art of Dying Well by Katy Butler EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}