{"title":"Cemetery Road by Greg Iles EPUB","magnet":"magnet:?xt=urn:btih:be1606a456202b86016dc41690db95e3b10191b9&dn=Cemetery+Road+by+Greg+Iles+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"1090771","seeders":"0","leechers":"0","description":"xx\r\n\r\nCemetery Road by Greg Iles EPUB\r\n\r\nThe number-one New York Times best-selling author of the Natchez Burning trilogy returns with an electrifying tale of friendship, betrayal, and shattering secrets that threaten to destroy a small Mississippi town.\r\n\r\nWhen Marshall McEwan left his hometown at age 18, he vowed never to return. The trauma that drove him away ultimately spurred him to become one of the most successful journalists in Washington DC. But just as the political chaos in the nation&#x2019;s capital lifts him to new heights, Marshall is forced to return home in spite of his boyhood vow. \r\n\r\nHis father is dying, his mother is struggling to keep the family newspaper from failing, and the town is in the midst of an economic rebirth that might be built upon crimes that reach into the state capitol - and perhaps even to Washington. More disturbing still, Marshall&#x2019;s high school sweetheart, Jet, has married into the family of Max Matheson, patriarch of one of the families that rule Bienville through a shadow organization called the Bienville Poker Club. \r\n\r\nWhen archaeologist Buck McKibben is murdered at a construction site, Bienville is thrown into chaos. The ensuing homicide investigation is soon derailed by a second crime that rocks the community to its core. Power broker Max Matheson&#x2019;s wife has been shot dead in her own bed, and the only other person in it at the time was her husband, Max. Stranger still, Max demands his daughter-in-law, Jet, defend him in court. \r\n\r\nAs a journalist, Marshall knows all too well how the corrosive power of money and politics can sabotage investigations. Without telling a soul, he joins forces with Jet, who has lived for 15 years at the heart of Max Matheson&#x2019;s family, and begins digging into both murders. With Jet walking the dangerous road of an inside informer, they soon uncover a web of criminal schemes that undergird the town&#x2019;s recent success. But these crimes pale in comparison to the secret at the heart of the Matheson family. When those who have remained silent for years dare to speak to Marshall, pressure begins to build like water against a crumbling dam. \r\n\r\nMarshall loses friends, family members, and finally, even Jet, for no one in Bienville seems willing to endure the reckoning the Poker Club has long deserved. By the time Marshall grasps the long-buried truth, he would give almost anything not to have to face it.\r\n\r\nxx","last_updated":"2019-03-05T10:35:51.158Z","parsed":{"xt":"urn:btih:be1606a456202b86016dc41690db95e3b10191b9","dn":"Cemetery Road by Greg Iles EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"be1606a456202b86016dc41690db95e3b10191b9","infoHashBuffer":{"type":"Buffer","data":[190,22,6,164,86,32,43,134,1,109,196,22,144,219,149,227,177,1,145,185]},"name":"Cemetery Road by Greg Iles EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}