{"title":"Unlocking the Customer Value Chain by Thales S. Teixeira EPUB","magnet":"magnet:?xt=urn:btih:d2796252dc2be5fe5c3ae8e31e0d858eb764cbe0&dn=Unlocking+the+Customer+Value+Chain+by+Thales+S.+Teixeira+EPUB&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969","uploader":"zakareya","categoryP":"other","categoryS":"e_books","size":"9583238","seeders":"0","leechers":"0","description":"xx\r\n\r\nUnlocking the Customer Value Chain by Thales S. Teixeira, Greg Piechota EPUB\r\n\r\nBased on six years of research, Harvard Business School Professor Thales Teixeira shows how and why industries are disrupted and what established companies can do to respond - as well as what potential start-ups must master if they hope to gain a competitive edge.\r\n\r\nAs it turns out, there is a pattern to disruption in an industry, whether the disruptor is Uber, Airbnb, or a dozen other start-ups that have shaken up incumbents and threatened the status quo.\r\n\r\nFor disruptors to pose a threat to an industry, they have to successfully break the link in choosing, purchasing, or consuming a product or service. Upstarts, Teixeira shows, do not attempt to compete with or overtake a reigning incumbent company entirely. Instead, they work to peel away a portion of the consumer decision-making process, the way Birchbox offered women a new way to sample new beauty products from a variety of cosmetics and fragrance companies, without having to go to the Revlon or Estee Lauder store. Zipcar doesn&apos;t attempt to compete head-to-head with GM but rather to offer people who need transportation an alternative way to get around, without owning a car themselves, or being responsible for fuel, maintenance, or insurance.\r\n\r\nIn a penetrating narrative filled with case studies and stories, Teixeira shows us how start-ups successfully disrupt industries - and what industry leaders must do to avoid being disrupted and protect their domain.\r\n\r\nxx","last_updated":"2019-03-05T10:12:45.764Z","parsed":{"xt":"urn:btih:d2796252dc2be5fe5c3ae8e31e0d858eb764cbe0","dn":"Unlocking the Customer Value Chain by Thales S. Teixeira EPUB","tr":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"infoHash":"d2796252dc2be5fe5c3ae8e31e0d858eb764cbe0","infoHashBuffer":{"type":"Buffer","data":[210,121,98,82,220,43,229,254,92,58,232,227,30,13,133,142,183,100,203,224]},"name":"Unlocking the Customer Value Chain by Thales S. Teixeira EPUB","announce":["udp://exodus.desync.com:6969","udp://open.demonii.com:1337","udp://tracker.coppersurfer.tk:6969","udp://tracker.leechers-paradise.org:6969","udp://zer0day.ch:1337"],"urlList":[]}}